export const curriculums = [
  {
    id: 1001,
    code: '001M',
    name: 'ฝึกอบรมข้าราชการบรรจุใหม่',
    learningObjective: 'โปรดดูรายวิชาในหลักสูตร',
    learningTopic: 'โปรดดูรายวิชาในหลักสูตร',
    targetGroup:
      '<ol>\r\n<li>เป็น<font color="red">ข้าราชการพลเรือน</font> หรือข้าราชประเภทอื่น ๆ ที่ได้รับอนุญาตให้เรียนได้</li> \r\n<li>เป็นผู้มีวินัยต่อการพัฒนาตนเอง มีความตั้งใจจริงในการเข้ารับ การอบรมแบบออนไลน์ พร้อมจะปฏิบัติตามหลักเกณฑ์ และเงื่อนไขต่าง ๆ</li>\r\n<li>เป็นผู้สามารถใช้เครื่องคอมพิวเตอร์ที่เชื่อมต่อระบบเครือข่ายอินเทอร์เน็ต เพื่อการอบรมออนไลน์ได้ตามกำหนด</li>\r\n</ol>',
    assessment:
      'เรียนผ่านทุกรายวิชาในหลักสูตร เข้าเรียนในแต่ละหัวข้อเป็นเวลาไม่น้อยกว่าที่กำหนดไว้ และทำแบบทดสอบหลังเรียนได้มากกว่า 60%',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/001M.jpg',
    ocscCurriculumCoursePair: [],
    ocscCurriculumRegistration: [],
  },
  {
    id: 1003,
    code: 'mini MPM',
    name: 'การบริหารจัดการภาครัฐแนวใหม่',
    learningObjective: 'โปรดดูรายวิชาในหลักสูตร',
    learningTopic: 'โปรดดูรายวิชาในหลักสูตร',
    targetGroup:
      '<ol>\r\n<li>เป็นข้าราชการ เจ้าหน้าที่ของรัฐ รัฐวิสาหกิจ บุคคลทั่วไป</li>\r\n<li>เป็นผู้มีวินัยต่อการพัฒนาตนเอง มีความตั้งใจจริงในการเข้ารับการอบรมแบบออนไลน์ พร้อมจะปฏิบัติตามหลักเกณฑ์ และเงื่อนไขต่าง ๆ</li>\r\n<li>เป็นผู้สามารถใช้เครื่องคอมพิวเตอร์ที่เชื่อมต่อระบบเครือข่ายอินเทอร์เน็ต เพื่อการอบรมออนไลน์ได้ตามกำหนด</li>\r\n</ol>\r\n\r\n<span style="color:red">เมื่อศึกษาครบ ทั้ง 10 วิชาตามกำหนด ท่านจะได้รับใบประกาศหลักสูตร จำนวน 1 ใบ เท่านั้น (ไม่มีใบประกาศรายวิชาย่อย)</span>',
    assessment:
      'เรียนผ่านทุกรายวิชาในหลักสูตร เข้าเรียนในแต่ละหัวข้อเป็นเวลาไม่น้อยกว่าที่กำหนดไว้ และทำแบบทดสอบหลังเรียนได้มากกว่า 60%',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/miniMPM.jpg',
    ocscCurriculumCoursePair: [],
    ocscCurriculumRegistration: [],
  },
  {
    id: 1004,
    code: 'mini MBA',
    name: 'การบริหารจัดการธุรกิจแนวใหม่',
    learningObjective: 'โปรดดูรายวิชาในหลักสูตร',
    learningTopic: 'โปรดดูรายวิชาในหลักสูตร',
    targetGroup:
      '<ol>\r\n<li>เป็นข้าราชการ เจ้าหน้าที่ของรัฐ รัฐวิสาหกิจ บุคคลทั่วไป</li>\r\n<li>เป็นผู้มีวินัยต่อการพัฒนาตนเอง มีความตั้งใจจริงในการเข้ารับการอบรมแบบออนไลน์ พร้อมจะปฏิบัติตามหลักเกณฑ์ และเงื่อนไขต่าง ๆ</li>\r\n<li>เป็นผู้สามารถใช้เครื่องคอมพิวเตอร์ที่เชื่อมต่อระบบเครือข่ายอินเทอร์เน็ต เพื่อการอบรมออนไลน์ได้ตามกำหนด</li>\r\n</ol>\r\n\r\n<span style="color:red">เมื่อศึกษาครบ ทั้ง 10 วิชาตามกำหนด ท่านจะได้รับใบประกาศหลักสูตร จำนวน 1 ใบ เท่านั้น (ไม่มีใบประกาศรายวิชาย่อย)</span>',
    assessment:
      'เรียนผ่านทุกรายวิชาในหลักสูตร เข้าเรียนในแต่ละหัวข้อเป็นเวลาไม่น้อยกว่าที่กำหนดไว้ และทำแบบทดสอบหลังเรียนได้มากกว่า 60%',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/miniMBA.jpg',
    ocscCurriculumCoursePair: [],
    ocscCurriculumRegistration: [],
  },
]
