export const curriculumRegistrations = [
  {
    id: 139264,
    userId: '1909802321001',
    curriculumId: 1003,
    registrationDate: '2024-02-11T05:46:14',
    satisfactionScore: null,
    isCompleted: false,
    completeDate: null,
    code: 'mini MPM',
    name: 'การบริหารจัดการภาครัฐแนวใหม่',
    learningObjective: 'โปรดดูรายวิชาในหลักสูตร',
    learningTopic: 'โปรดดูรายวิชาในหลักสูตร',
    targetGroup:
      '<ol>\r\n<li>เป็นข้าราชการ เจ้าหน้าที่ของรัฐ รัฐวิสาหกิจ บุคคลทั่วไป</li>\r\n<li>เป็นผู้มีวินัยต่อการพัฒนาตนเอง มีความตั้งใจจริงในการเข้ารับการอบรมแบบออนไลน์ พร้อมจะปฏิบัติตามหลักเกณฑ์ และเงื่อนไขต่าง ๆ</li>\r\n<li>เป็นผู้สามารถใช้เครื่องคอมพิวเตอร์ที่เชื่อมต่อระบบเครือข่ายอินเทอร์เน็ต เพื่อการอบรมออนไลน์ได้ตามกำหนด</li>\r\n</ol>\r\n\r\n<span style="color:red">เมื่อศึกษาครบ ทั้ง 10 วิชาตามกำหนด ท่านจะได้รับใบประกาศหลักสูตร จำนวน 1 ใบ เท่านั้น (ไม่มีใบประกาศรายวิชาย่อย)</span>',
    assessment:
      'เรียนผ่านทุกรายวิชาในหลักสูตร เข้าเรียนในแต่ละหัวข้อเป็นเวลาไม่น้อยกว่าที่กำหนดไว้ และทำแบบทดสอบหลังเรียนได้มากกว่า 60%',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/miniMPM.jpg',
  },
  {
    id: 139263,
    userId: '1909802321001',
    curriculumId: 1004,
    registrationDate: '2024-02-11T05:30:30',
    satisfactionScore: null,
    isCompleted: false,
    completeDate: null,
    code: 'mini MBA',
    name: 'การบริหารจัดการธุรกิจแนวใหม่',
    learningObjective: 'โปรดดูรายวิชาในหลักสูตร',
    learningTopic: 'โปรดดูรายวิชาในหลักสูตร',
    targetGroup:
      '<ol>\r\n<li>เป็นข้าราชการ เจ้าหน้าที่ของรัฐ รัฐวิสาหกิจ บุคคลทั่วไป</li>\r\n<li>เป็นผู้มีวินัยต่อการพัฒนาตนเอง มีความตั้งใจจริงในการเข้ารับการอบรมแบบออนไลน์ พร้อมจะปฏิบัติตามหลักเกณฑ์ และเงื่อนไขต่าง ๆ</li>\r\n<li>เป็นผู้สามารถใช้เครื่องคอมพิวเตอร์ที่เชื่อมต่อระบบเครือข่ายอินเทอร์เน็ต เพื่อการอบรมออนไลน์ได้ตามกำหนด</li>\r\n</ol>\r\n\r\n<span style="color:red">เมื่อศึกษาครบ ทั้ง 10 วิชาตามกำหนด ท่านจะได้รับใบประกาศหลักสูตร จำนวน 1 ใบ เท่านั้น (ไม่มีใบประกาศรายวิชาย่อย)</span>',
    assessment:
      'เรียนผ่านทุกรายวิชาในหลักสูตร เข้าเรียนในแต่ละหัวข้อเป็นเวลาไม่น้อยกว่าที่กำหนดไว้ และทำแบบทดสอบหลังเรียนได้มากกว่า 60%',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/miniMBA.jpg',
  },
]
