export const recommendedCourses = [
  {
    id: 1164,
    code: 'DS26',
    name: 'AI Basic',
    courseCategoryId: 4,
    instructor: 'Microsoft Thailand',
    courseCategory: 'ทักษะดิจิทัล',
    learningObjective:
      'ในซีรีส์วิดีโอนี้ คุณจะสำรวจอดีตของ AI และรับข้อมูลเชิงลึกเกี่ยวกับวิวัฒนาการของ AI จนกลายมาเป็นส่วนสำคัญของโลกยุคใหม่ของเรา ซึ่งส่งผลกระทบต่อทุกสิ่งทุกอย่างตั้งแต่บ้านไปจนถึงที่ทำงานของเรา',
    learningTopic:
      '<ol><li>บทที่ 1 ประวัติโดยย่อของ AI</li><li>บทที่ 2 ปัญญาประดิษฐ์คืออะไร</li><li>บทที่ 3 เปรียบความฉลาดกับความรู้</li><li>บทที่ 4 ข้อมูลอยู่ทุกที่</li><li>บทที่ 5 การค้นหารูปแบบในข้อมูล</li><li>บทที่ 6 Machine Learning</li><li>บทที่ 7 ประเภทของ Machine Learning</li><li>บทที่ 8 การเรียนรู้เชิงลึก</li><li>บทที่ 9 การประมวลผลภาษาธรรมชาติ (NLP)</li><li>บทที่ 10 อัลกอริทึมของ AI</li><li>บทที่ 11 AI ในการใช้งานจริง</li><li>บทที่ 12 Generative AI หรือ ปัญญาประดิษฐ์เชิงสร้างสรรค์ คืออะไร?</li><li>บทที่ 13 โมเดล Generative AI คืออะไร</li><li>บทที่ 14 ภาษาศาสตร์ทาง AI</li><li>บทที่ 15 การสร้างภาพด้วย AI – สร้างภาพจากข้อความ</li><li>บทที่ 16 AI เพื่อนคู่ใจในการสร้างสรรค์คอนเทนต์</li><li>บทที่ 17 โอกาสใหม่ที่มากับ Generative AI</li><li>บทที่ 18 วิวัฒนาการของการค้นหา</li><li>บทที่ 19 เครื่องมือค้นหา หรือ Search Engine ทำงานอย่างไร?</li><li>บทที่ 20 เครื่องมือให้เหตุผล</li><li>บทที่ 21 วิธีการค้นหาแบบใหม่ Microsoft Copilot</li><li>บทที่ 22 เทคนิคการสร้างพรอมต์</li><li>บทที่ 23 แนวปฏิบัติที่ดีที่สุดในการสร้างพรอมท์</li><li>บทที่ 24 ความคิดวิเคราะห์ (Critical Thinking)</li><li>บทที่ 25 การใช้ AI อย่างรับผิดชอบ แนวทางปฏิบัติที่ดีที่สุด</li><li>บทที่ 26 หลักการของ AI ที่มีความรับผิดชอบ</li><li>บทที่ 27 Deepfakes และลิขสิทธิ์ใน AI</li><li>บทที่ 28 ปฏิสัมพันธ์ระหว่างมนุษย์และ AI และผลกระทบทั่วโลก</li><li>บทที่ 29 Microsoft Copilot คืออะไร?</li><li>บทที่ 30 เริ่มต้นใช้งาน Copilot การตั้งค่าและประเภทบัญชี</li><li>บทที่ 31 การรองรับภาษาและการเข้าถึงใน Copilot</li><li>บทที่ 32 เคล็ดลับในการสนทนากับ Copilot ให้มีประสิทธิภาพ</li><li>บทที่ 33 รู้จัก GPT และปลั๊กอินใน Copilot</li><li>บทที่ 34 เปลี่ยนไอเดียให้เป็นจริงด้วย Copilot</li><li>บทที่ 35 จัดการเวลาอย่างมีประสิทธิภาพด้วย Copilot</li><li>บทที่ 36 ยกระดับการหางานของคุณด้วย Copilot</li><li>บทที่ 37 พัฒนาทักษะไปกับ Copilot</li><li>บทที่ 38 การวิเคราะห์รูปภาพและเอกสารด้วย Copilot</li><li>บทที่ 39 Copilot เสริมประสิทธิภาพการทำงาน</li><li>บทที่ 40 เพิ่มประสิทธิภาพการทำงานของคุณด้วย Copilot ใน Edge</li><li>บทที่ 41 AI กำลังเปลี่ยนโลกอย่างไร ให้ทุกคนเข้าถึงได้มากขึ้น</li><li>บทที่ 42 ผลกระทบของ AI ต่อบทบาทงานต่าง ๆ</li><li>บทที่ 43 AI พันธมิตรเพื่อมนุษยธรรม</li><li>บทที่ 44 AI ที่ทุกคนเข้าถึงได้ด้วย Copilot</li></ol>',
    targetGroup: '<ol><li>บุคลากรภาครัฐ</li><li>บุคคลทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 60 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/DS26.jpg',
    seqFlow: false,
  },
  {
    id: 1165,
    code: 'DS27',
    name: 'AI Skills for All',
    courseCategoryId: 4,
    instructor: 'Microsoft Thailand',
    courseCategory: 'ทักษะดิจิทัล',
    learningObjective:
      'หลักสูตรทักษะด้าน AI ออกแบบมาเพื่อให้ความรู้แก่บุคคลทั่วไปเกี่ยวกับพื้นฐานของ AI และเพิ่มขีดความสามารถในการผสานเทคโนโลยีอันทรงพลังนี้เข้ากับชีวิตประจำวัน เนื้อหาประกอบด้วยเซสชั่นที่ครอบคลุมหัวข้อต่าง ๆ เกี่ยวกับ AI',
    learningTopic:
      '<ol><li>บทที่ 1 บทนำ Copilot</li><li>บทที่ 2 การสร้างรูปภาพด้วย Microsoft Copilot</li><li>บทที่ 3 การใช้งาน Clipchamp เพื่อตัดต่อวิดีโอ</li><li>บทที่ 4 เทคนิคการเล่าเรื่องและการสร้างข้อมูลตามความต้องการของแต่ละบุคคล</li><li>บทที่ 5 การแปลภาษาด้วย Copilot</li><li>บทที่ 6 Generative AI คืออะไร</li><li>บทที่ 7 การเข้าใช้งาน Microsoft Copilot</li><li>บทที่ 8 คำสั่งพื้นฐานใน Microsoft Copilot</li><li>บทที่ 9 ข้อควรระวังในการใช้ Generative AI</li><li>บทที่ 10 การสร้างบทบาทสมมุติให้ Generative AI</li><li>บทที่ 11 การกำหนดรูปแบบข้อมูลผลลัพธ์</li><li>บทที่ 12 การใช้ Generative AI ในการวางแผนธุรกิจท่องเที่ยว</li></ol>',
    targetGroup: '<ol><li>บุคลากรภาครัฐ</li><li>บุคคลทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 60 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/DS27.jpg',
    seqFlow: false,
  },
  {
    id: 1166,
    code: 'KD58',
    name: 'ความรู้เกี่ยวกับกระบวนการยุติธรรมทางอาญาในการดำเนินคดียาเสพติด (Knowledge of Criminal Justice System in Conducting Narcotic Cases)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>ดร. ภูวิชชชญา เหลืองธีรกุล (อัยการจังหวัดประจำสำนักงานอัยการสูงสุด)</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้ความรู้เกี่ยวกับการดำเนินคดียาเสพติดในชั้นก่อนฟ้องจนถึงการดำเนินคดีในชั้นศาล ซึ่งจะทำให้ผู้เรียนสามารถมีความรู้ความเข้าใจในขั้นตอนการทำงานของพนักงานอัยการ ตั้งแต่เริ่มรับสำนวนจากพนักงานสอบสวน การตรวจเอกสารสำนวนเบื้องต้น เขตอำนาจศาล อายุความ ระยะเวลาคุมสำนวน การยื่นเอกสาร องค์ประกอบฟ้องที่จำเป็น ขั้นตอนการดำเนินคดีในศาล ตลอดจนปัญหาที่พบและเทคนิคการแก้ปัญหานั้น ๆ</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถระบุได้ว่าสำนวนคดียาเสพติดเบื้องต้นที่รับมาจากพนักงานสอบสวนจะต้องมีเอกสารที่จำเป็นอะไรบ้าง</li><li>ผู้เรียนสามารถระบุเขตอำนาจศาล อายุความ ระยะเวลาคุมสำนวน การยื่นคำร้องหรือเอกสารต่าง ๆในคดียาเสพติดได้</li><li>ผู้เรียนสามารถระบุองค์ประกอบคำฟ้องคดียาเสพติดที่จำเป็นได้อย่างถูกต้อง</li><li>ผู้เรียนสามารถระบุขั้นตอนการดำเนินคดียาเสพติดในชั้นศาลได้</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหาในการทำงานทั่วไปที่พบในการดำเนินคดียาเสพติดในชั้นก่อนฟ้อง การสั่งคดีตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำหลักการในการดำเนินคดียาเสพติดไประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น พนักงานสอบสวน เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD58.jpg',
    seqFlow: false,
  },
  {
    id: 1167,
    code: 'KD59',
    name: 'ความรู้เกี่ยวกับการดำเนินคดีแพ่งให้หน่วยงานของรัฐ  (Knowledge of Conducting Civil Cases for State Agencies)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>นางสาวภัทรสุดา บุญกิตติเจริญ (อัยการจังหวัดประจำสำนักงานอัยการสูงสุด)</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้หน่วยงานของรัฐ ราชการส่วนกลาง ราชการส่วนภูมิภาค ราชการส่วนท้องถิ่น รัฐวิสาหกิจ  องค์การมหาชน หน่วยงานอื่นของรัฐ มีความรู้ความเข้าใจในหลักการรวบรวมพยานหลักฐานเกี่ยวกับคดีแพ่ง ขั้นตอนในการส่งเรื่องให้สำนักงานอัยการสูงสุดตามอำนาจหน้าที่ และหน่วยงานดังกล่าวสามารถดำเนิน  กระบวนงานทั้งหมดในการดำเนินคดีได้อย่างถูกต้อง</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถรวบรวมพยานหลักฐานเกี่ยวกับคดีแพ่งได้อย่างครบถ้วนและถูกต้อง</li><li>ผู้เรียนสามารถระบุเขตอำนาจศาล อายุความ ระยะเวลาในการดำเนินคดีแพ่ง</li><li>ผู้เรียนสามารถดำเนินการในชั้นก่อนฟ้องและหลังยื่นคำฟ้องในการดำเนินคดีแพ่งได้อย่างถูกต้อง</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหาในการทำงานทั่วไปที่พบในการดำเนินคดีแพ่งในชั้นก่อนฟ้อง การสั่งคดี ตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำหลักการในการดำเนินคดีแพ่งไปประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น พนักงานสอบสวน เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD59.jpg',
    seqFlow: false,
  },
  {
    id: 1168,
    code: 'KD60',
    name: 'ความรู้เกี่ยวกับการบังคับคดีให้หน่วยงานของรัฐ (Knowledge of Conducting Legal Execution for State Agencies)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>นายพลวัฒน์ โรจน์บุญฤทธิ์ / อัยการจังหวัดประจำสำนักงานอัยการสูงสุด</li><li>นายธนเสฏฐ์ อ่อนละเอียด / อัยการจังหวัดประจำสำนักงานอัยการสูงสุด</li><li>นางสาวยุวดี คล้ายสาหร่าย / นิติกรชำนาญการพิเศษ</li><li>นายอิศเรศ นาคเทศ / เจ้าพนักงานคดีปฏิบัติการ</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้หน่วยงานของรัฐ ราชการส่วนกลาง ราชการส่วนภูมิภาค ราชการส่วนท้องถิ่น รัฐวิสาหกิจ องค์การมหาชน หน่วยงานอื่นของรัฐ มีความรู้ความเข้าใจเกี่ยวกับการบังคับคดีแพ่ง คดีปกครอง คดีอาญา และบังคับคดีกรณีผิดสัญญาประกันต่อศาลและประกันรับสิ่งของไปดูแลรักษา การตรวจสอบสถานะทรัพย์สินของลูกหนี้ ขั้นตอนในการส่งเรื่องให้สำนักงานอัยการสูงสุดตามอำนาจหน้าที่ และหน่วยงานดังกล่าวสามารถดำเนินกระบวนงานทั้งหมดในการดำเนินคดีได้อย่างถูกต้อง</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถรวบรวมพยานหลักฐานเกี่ยวกับการบังคับคดีแพ่ง คดีปกครอง คดีอาญา และบังคับคดีกรณีผิดสัญญาประกันต่อศาลและประกันรับสิ่งของไปดูแลรักษา ได้อย่างครบถ้วนและถูกต้อง</li><li>ผู้เรียนสามารถระบุเขตอำนาจสำนักงานอัยการที่รับผิดชอบ อายุความ ระยะเวลาในการดำเนินการบังคับคดี</li><li>ผู้เรียนสามารถระบุว่าพนักงานอัยการหรือนิติกรจะต้องเตรียมการ ดำเนินการในชั้นบังคับคดีอย่างไร ทั้งขั้นตอนเอกสารที่ต้องใช้และสามารถดำเนินการในชั้นบังคับคดีได้อย่างถูกต้อง</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหาในการทำงานทั่วไปที่พบในการบังคับคดีแพ่ง คดีปกครอง คดีอาญา และบังคับคดีกรณีผิดสัญญาประกันต่อศาลและประกันรับสิ่งของไปดูแลรักษาการสั่งคดี ตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำหลักการในการดำเนินคดีแพ่ง คดีปกครอง คดีอาญา และบังคับคดีกรณีผิดสัญญาประกันต่อศาลและประกันรับสิ่งของไปดูแลรักษา ไปประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li><li>ผู้เรียนสามารถดำเนินการในชั้นก่อนฟ้อง และหลังยื่นฟ้อง ตลอดจนการบังคับคดี ในคดีปรับเป็นพินัยได้อย่างถูกต้อง และสามารถนำหลักการตามพระราชบัญญัติว่าด้วยการปรับเป็นพินัย พ.ศ. ๒๕๖๕ ไปใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD60.jpg',
    seqFlow: false,
  },
  {
    id: 1169,
    code: 'KD61',
    name: 'ความรู้เกี่ยวกับกระบวนการยุติธรรมทางอาญาในการดำเนินคดีความผิดเกี่ยวกับการค้ามนุษย์ (Knowledge of Criminal Justice System in Conducting Human Trafficking Cases)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>นายสุรเชษฐ์  เณรบำรุง / อัยการจังหวัดประจำสำนักงานอัยการสูงสุด</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้ความรู้เกี่ยวกับการดำเนินคดีค้ามนุษย์ในชั้นก่อนฟ้องจนถึงการดำเนินคดีในชั้นศาล ซึ่งจะทำให้ผู้เรียนสามารถมีความรู้ความเข้าใจในขั้นตอนตั้งแต่เริ่มร่วมสอบสวนกับพนักงานสอบสวน การคัดแยกผู้เสียหายในคดีค้ามนุษย์ การเข้าร่วมประชุมเพื่อพิจารณาค่าสินไหมทดแทนของผู้เสียหาย การทำงานของพนักงานอัยการ การตรวจเอกสารสำนวนเบื้องต้นเขตอำนาจศาล อายุความ ระยะเวลาคุมสำนวน การยื่นเอกสาร องค์ประกอบฟ้องที่จำเป็น ขั้นตอนการดำเนินคดีในศาล ตลอดจนปัญหาที่พบ และเทคนิคการแก้ปัญหานั้น ๆ</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถอธิบายและปฏิบัติตามขั้นตอนตั้งแต่เริ่มสอบสวนกับพนักงานสอบสวนได้</li><li>ผู้เรียนสามารถคัดแยกผู้เสียหายในคดีค้ามนุษย์ การเข้าร่วมประชุมเพื่อพิจารณาค่าสินไหมทดแทนของผู้เสียหาย</li><li>ผู้เรียนสามารถระบุเขตอำนาจศาล อายุความ ระยะเวลาคุมสำนวน การยื่นคำร้องหรือเอกสารต่าง ๆ ในคดีค้ามนุษย์ได้</li><li>ผู้เรียนสามารถระบุองค์ประกอบคำฟ้องคดีค้ามนุษย์ที่จำเป็นได้อย่างถูกต้อง</li><li>ผู้เรียนสามารถระบุขั้นตอนการดำเนินคดีค้ามนุษย์ในชั้นศาลได้</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหาในการทำงานทั่วไปที่พบในการดำเนินคดีค้ามนุษย์ในชั้นก่อนฟ้อง การสั่งคดี ตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำหลักการในการดำเนินคดีค้ามนุษย์ไปประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น พนักงานสอบสวน เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD61.jpg',
    seqFlow: false,
  },
  {
    id: 1170,
    code: 'KD62',
    name: 'ความรู้เกี่ยวกับกระบวนการยุติธรรมทางอาญาในการดำเนินคดีทุจริตและประพฤติมิชอบ (Knowledge of Criminal Justice System in Conducting Corruption and Misconduct Cases)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>นายอรินทัต ศรีขจรลาภ / อัยการจังหวัดประจำสำนักงานอัยการสูงสุด</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้ความรู้เกี่ยวกับการดำเนินคดีทุจริตและประพฤติมิชอบในชั้นก่อนฟ้องจนถึงการดำเนินคดีในชั้นศาล ซึ่งจะทำให้ผู้เรียนสามารถมีความรู้ความเข้าใจบทบาทและอำนาจหน้าที่ของพนักงานอัยการเกี่ยวกับการดำเนินคดีทุจริตและประพฤติมิชอบ ในขั้นตอนตั้งแต่กระบวนการในชั้นพิจารณาสำนวน การตรวจเอกสาร การทำความเห็นและคำสั่งคดี บทกฎหมายและพยานหลักฐานที่เกี่ยวข้องกับการดำเนินคดี การบรรยายฟ้อง และขั้นตอนการดำเนินคดีในชั้นศาล ตลอดจนปัญหาที่พบและวิธีการแก้ปัญหาดังกล่าว</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถมีความรู้ความเข้าใจกฎหมายคดีทุจริตและประพฤติมิชอบ และขั้นตอนการดำเนินคดีทุจริตและประพฤติมิชอบ</li><li>ผู้เรียนได้รับความรู้เกี่ยวกับกฎหมาย และระเบียบที่เกี่ยวข้องกับการดำเนินคดีทุจริตและประพฤติมิชอบ ประเภทของคดีทุจริตและประพฤติมิชอบ สามารถระบุเขตอำนาจศาล อายุความ ระยะเวลาการดำเนินคดีตามกฎหมาย ตรวจเอกสารในสำนวนและพิจารณาสำนวนคดีทุจริตและประพฤติมิชอบได้อย่างถูกต้องครบถ้วน</li><li>ผู้เรียนสามารถทำความเห็นและคำสั่ง และระบุองค์ประกอบความผิด ร่างคำฟ้องคดีทุจริตและประพฤติมิชอบ ได้อย่างถูกต้องตามขั้นตอนตามกฎหมายและระเบียบที่เกี่ยวข้อง</li><li>ผู้เรียนมีความรู้และสามารถระบุขั้นตอนการดำเนินคดีทุจริตและประพฤติมิชอบในชั้นศาล</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหาในการทำงานทั่วไปที่พบในการดำเนินคดีทุจริตและประพฤติมิชอบในชั้นก่อนฟ้อง การสั่งคดี ตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำหลักการในการดำเนินคดีทุจริตและประพฤติมิชอบไปประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น พนักงานสอบสวน เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD62.jpg',
    seqFlow: false,
  },
  {
    id: 1171,
    code: 'KD63',
    name: 'ความรู้เกี่ยวกับการคุ้มครองเด็กในกระบวนการยุติธรรมทางอาญา (Knowledge of child protection in the criminal justice process)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>นางธีราพร สุริสีหเสถียร /อัยการจังหวัดคุ้มครองสิทธิและช่วยเหลือทางกฎหมายและการบังคับคดีจังหวัดอ่างทอง</li><li>นางสันทนี ดิษยบุตร /ผู้อำนวยการ สำนักงานเลขาธิการสถาบันนิติวัชร์ สถาบันนิติวัชร์</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้ความรู้เกี่ยวกับหลักการสากลในการคุ้มครองเด็กที่เข้าสู่กระบวนการยุติธรรมทางอาญา ทั้งกรณีเด็กเป็นผู้เสียหาย พยาน หรือผู้ต้องหา ตลอดจนหลักกฎหมายที่เกี่ยวกับการคุ้มครองเด็กผู้เสียหายที่ถูกกระทำความรุนแรง การคุ้มครองเด็กผู้เสียหายหรือพยานที่เข้าสู่กระบวนการยุติธรรม เช่น วิธีการถามปากคำเด็ก สถานที่ในการถามปากคำเด็ก การสืบพยานเด็กในชั้นศาล และความสอดคล้องของกฎหมายไทยกับหลักการคุ้มครองเด็กตามมาตรฐานระหว่างประเทศดังกล่าว รวมถึงขั้นตอนในการดำเนินคดีเด็กและเยาวชนที่กระทำความผิดตั้งแต่ชั้นก่อนฟ้องคดี  เช่น การสอบปากคำ การตรวจสอบการจับ การพิจารณาเรื่องเขตอำนาจศาล ระยะเวลาในการดำเนินคดีตามกฎหมาย การสั่งสำนวนคดีและการยื่นคำฟ้อง จนถึงการดำเนินคดีในชั้นศาล จนกระทั่งศาลมีคำพิพากษา และการดำเนินคดีในชั้นอุทธรณ์ ฎีกา</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถอธิบายหลักการสากล และหลักกฎหมายของไทยเกี่ยวกับการคุ้มครองเด็กที่เข้าสู่กระบวนการยุติธรรมทางอาญา ทั้งกรณีเด็กเป็นผู้เสียหาย พยาน หรือผู้ต้องหา</li><li>ผู้เรียนมีความรู้และสามารถอธิบายขั้นตอนการดำเนินคดีที่เด็กและเยาวชนเป็นผู้กระทำความผิดในชั้นก่อนฟ้อง เช่น การสอบปากคำ การตรวจสอบการจับ การพิจารณาเรื่องเขตอำนาจศาล ระยะเวลาในการดำเนินคดีตามกฎหมาย การสั่งสำนวนคดีและการยื่นคำฟ้องได้อย่างถูกต้องตามขั้นตอนตามกฎหมายและระเบียบที่เกี่ยวข้อง</li><li>ผู้เรียนมีความรู้และสามารถอธิบายขั้นตอนการดำเนินคดีที่เด็กและเยาวชนเป็นผู้กระทำความผิดในชั้นศาล และชั้นอุทธรณ์ ฎีกา ได้อย่างถูกต้องตามขั้นตอนตามกฎหมายและระเบียบที่เกี่ยวข้อง</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหาในการทำงานทั่วไปที่พบในการดำเนินคดีเด็กและเยาวชนในชั้นก่อนฟ้อง การสั่งคดี ตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำความรู้เกี่ยวกับการคุ้มครองเด็กในกระบวนการยุติธรรมทางอาญาไปประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น พนักงานสอบสวน เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD63.jpg',
    seqFlow: false,
  },
  {
    id: 1172,
    code: 'KD64',
    name: 'ความรู้เกี่ยวกับการดำเนินคดีอาชญากรรมทางเทคโนโลยี (Knowledge of the prosecution of cybercrime)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>นายปกรณ์ ธรรมโรจน์ (อัยการผู้เชี่ยวชาญ)</li><li>พ.ต.อ.หญิง มนชนก จำรูญโรจน์ (ผู้กำกับการกลุ่มงานตรวจพิสูจน์พยานหลักฐานดิจิทัล   กองบัญชาการตำรวจสืบสวนสอบสวนอาชญากรรมทางเทคโนโลยี สำนักงานตำรวจแห่งชาติ)</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้ความรู้เกี่ยวกับหลักการพื้นฐานเกี่ยวกับพยานหลักฐานในคดีอาชญากรรมทางเทคโนโลยี หลักกฎหมายทั้งกฎหมายสารบัญญัติ และวิธีสบัญญัติ  ที่เกี่ยวข้องกับการดำเนินคดีอาชญากรรมทางเทคโนโลยี ตัวอย่างคดีอาชญากรรมทางเทคโนโลยี ในสภาพสังคมยุคใหม่ รวมถึงขั้นตอนในการดำเนินคดีอาชญากรรมทางเทคโนโลยีตั้งแต่ชั้นก่อนฟ้องคดี เช่น  การสืบสวนสอบสวนหาพยานหลักฐาน การตรวจสำนวนและการพิจารณาสั่งสำนวนคดี การจัดทำคำฟ้อง จนถึงการดำเนินคดีในชั้นศาล</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถอธิบายหลักการพื้นฐานเกี่ยวกับพยานหลักฐานในคดีอาชญากรรมทางเทคโนโลยีหลักกฎหมายทั้งกฎหมายสารบัญญัติ และวิธีสบัญญัติที่เกี่ยวข้องกับการดำเนินคดีอาชญากรรมทางเทคโนโลยี</li><li>ผู้เรียนมีความรู้และสามารถอธิบายขั้นตอนการดำเนินคดีอาชญากรรมทางเทคโนโลยี ในชั้นก่อนฟ้อง เช่น การสืบสวนสอบสวนหาพยานหลักฐาน การตรวจสำนวนและการพิจารณาสั่งสำนวนคดีการจัดทำคำฟ้องได้อย่างถูกต้องตามขั้นตอนตามกฎหมายและระเบียบที่เกี่ยวข้อง</li><li>ผู้เรียนมีความรู้และสามารถอธิบายขั้นตอนการดำเนินคดีอาชญากรรมทางเทคโนโลยีในชั้นศาลได้อย่างถูกต้องตามขั้นตอนตามกฎหมายและระเบียบที่เกี่ยวข้อง</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหาในการทำงานทั่วไปที่พบในการดำเนินคดีอาชญากรรมทางเทคโนโลยี ในชั้นก่อนฟ้อง การสั่งคดี ตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำความรู้เกี่ยวกับการดำเนินคดีอาชญากรรมทางเทคโนโลยีไปประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น พนักงานสอบสวน เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD64.jpg',
    seqFlow: false,
  },
  {
    id: 1173,
    code: 'KD65',
    name: 'ความรู้เกี่ยวกับการดำเนินคดีป่าไม้ คดีทรัพยากรธรรมชาติและสิ่งแวดล้อม (Knowledge of the prosecution of Forestry, Natural Resource and Environmental Cases)',
    courseCategoryId: 1,
    instructor:
      '<ol><li>นายกันตพิชญ์ อินชมภู / รองอัยการจังหวัดหลังสวน</li><li>ดร.พงษ์ศักดิ์ วิทวัสชุติกุล / อดีตผู้เชี่ยวชาญด้านการอนุรักษ์และจัดการต้นน้ำ กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช</li><li>นายจุมพฏ ชอบธรรม / ผู้อำนวยการกองนิติการ กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช</li><li>นายวิจารณ์ เสนสกุล / ผู้อำนวยการกลุ่มนิติการ กรมป่าไม้</li></ol>',
    courseCategory: 'การพัฒนาองค์ความรู้',
    learningObjective:
      '<ol><li>วิชานี้มุ่งให้ความรู้เกี่ยวกับแนวคิดในการอนุรักษ์ทรัพยากรป่าไม้และสัตว์ป่าตามกฎหมาย หลักการคิดคำนวณค่าเสียหายทางสิ่งแวดล้อมในการอนุรักษ์ป่าไม้ ขั้นตอนในการดำเนินคดีป่าไม้ คดีทรัพยากรธรรมชาติและสิ่งแวดล้อมตั้งแต่ชั้นก่อนฟ้องคดี เช่น การสืบสวนหาพยานหลักฐาน การตรวจสำนวนและการพิจารณา สั่งสำนวนคดี การจัดทำคำฟ้อง คำขอท้ายฟ้องและการดำเนินกระบวนการเกี่ยวกับของกลางในคดี ตลอดจนถึงการดำเนินคดีในชั้นศาล</li></ol>',
    learningTopic:
      '<ol><li>ผู้เรียนสามารถอธิบายหลักการเกี่ยวกับแนวคิดในการอนุรักษ์ทรัพยากรป่าไม้และสัตว์ป่าตาม กฎหมายที่เกี่ยวข้อง และหลักการคิดคำนวณค่าเสียหายทางสิ่งแวดล้อมในการอนุรักษ์ป่าไม้</li><li>ผู้เรียนมีความรู้และสามารถอธิบายขั้นตอนการดำเนินคดีป่าไม้ คดีทรัพยากรธรรมชาติและ สิ่งแวดล้อมในชั้นก่อนฟ้องคดี เช่น การสืบสวนหาพยานหลักฐาน การตรวจสำนวนและการพิจารณา สั่งสำนวน การจัดทำคำฟ้อง คำขอท้ายฟ้องและการดำเนินกระบวนการเกี่ยวกับของกลางได้อย่าง ถูกต้องตามขั้นตอนตามกฎหมายและระเบียบที่เกี่ยวข้อง</li><li>ผู้เรียนมีความรู้และสามารถอธิบายขั้นตอนการดำเนินคดีป่าไม้ คดีทรัพยากรธรรมชาติและ สิ่งแวดล้อมในชั้นศาล และชั้นอุทธรณ์ ฎีกา ได้อย่างถูกต้องตามขั้นตอนตามกฎหมายและระเบียบที่เกี่ยวข้อง</li><li>ผู้เรียนสามารถระบุปัญหาทั่วไปที่พบในการปฏิบัติงานและสามารถอธิบายวิธีการแก้ปัญหา ในการทำงานทั่วไปที่พบในการดำเนินคดีป่าไม้ คดีทรัพยากรธรรมชาติและสิ่งแวดล้อมในชั้นก่อนฟ้อง การสั่งคดี ตลอดจนการดำเนินคดีในชั้นศาลได้</li><li>ผู้เรียนสามารถนำความรู้เกี่ยวกับการดำเนินคดีป่าไม้ คดีทรัพยากรธรรมชาติและสิ่งแวดล้อม ไปประยุกต์ใช้ในการปฏิบัติงานในหน่วยงานของตนได้</li></ol>',
    targetGroup:
      '<ol><li>บุคลากรของสำนักงานอัยการสูงสุด บุคลากรในหน่วยงานด้านกระบวนการยุติธรรมอื่นที่ต้องเกี่ยวข้องกับการทำงานของพนักงานอัยการ เช่น พนักงานสอบสวน เจ้าพนักงานคดี นิติกร เป็นต้น และประชาชนทั่วไป</li></ol>',
    assessment: 'ทำแบบทดสอบหลังเรียนได้ตั้งแต่ 70 % ขึ้นไป',
    thumbnail:
      'https://learningportal.ocsc.go.th/content/images/courses/ocsc/KD65.jpg',
    seqFlow: false,
  },
]
